const React = require("react");
const ReactDOM = require("react-dom");
const Provider = require("react-redux").Provider;
const reducer = require("./Reducer.jsx");
const AppView = require("./AppView.jsx");
import { configureStore } from '@reduxjs/toolkit'

const store = configureStore({reducer});

store.dispatch({
    type: "SET_STATE",
    state: {
        
        Info: {
            title:"КОРУПЦІЯ",
            date:"08 БЕРЕЗНЯ 2023",
            address:"Одеський академічний театр музичної комедії ім. М. Водяного",
            img:"./img/kup.jpg",
            price:"Ціна: 300-2200 грн",
            info:`Музичний концерт для жінок від Міші Крупіна та гурту «Корупція» в Одесі
            Мішу Крупіна та гурт «Корупція» впізнати легко з перших нот – мотиви джазу, репу та фольку поєднується у творчості музикантів. Їх музика круто звучить будь-де, але найкраще на їх живих концертах. Так от жителі та гості Одеси матимуть змогу зустрітися з гуртом «Корупція» 8 березня у театрі музкомедії на їх концерті.
            
            Зазначимо, що ця подія буде найкращим подарунком для жінки, бо тут хлопці співатимуть з любов’ю для найкрасивішої частини людства, щоб привітати зі святом весни. Тому пропонуємо придбати квитки для себе та у подарунок.
            
            Більшеподарунків у вигляді концертів в Одесі можете шукати на афіші нашого сайту.`
        },
        Events_In_Odessa: 
        [
            {
                title:"КОРУПЦІЯ",
                date:"08 БЕРЕЗНЯ 2023",
                address:"Одеський академічний театр музичної комедії ім. М. Водяного",
                img:"./img/kup.jpg",
                price:"Ціна: 300-2200 грн",
                info:`Музичний концерт для жінок від Міші Крупіна та гурту «Корупція» в Одесі
                Мішу Крупіна та гурт «Корупція» впізнати легко з перших нот – мотиви джазу, репу та фольку поєднується у творчості музикантів. Їх музика круто звучить будь-де, але найкраще на їх живих концертах. Так от жителі та гості Одеси матимуть змогу зустрітися з гуртом «Корупція» 8 березня у театрі музкомедії на їх концерті.
                
                Зазначимо, що ця подія буде найкращим подарунком для жінки, бо тут хлопці співатимуть з любов’ю для найкрасивішої частини людства, щоб привітати зі святом весни. Тому пропонуємо придбати квитки для себе та у подарунок.
                
                Більшеподарунків у вигляді концертів в Одесі можете шукати на афіші нашого сайту.`
            },
            {   
                title:"ALICE",
                date:"08 БЕРЕЗНЯ 2023",
                address:"Одеський академічний театр музичної комедії ім. М. Водяного м. Одеса, вул. Пантелеймонівська, 3",
                img:"./img/Ali.jpg",
                price:"Ціна: 200-700 грн",
                info:`Чарівне циркове шоу «Alice» в Одесі
                Кожна людина, попри свій вік, хоч раз бажала опинитися у чарівному світі. Зараз ви маєте цю нагоду. В Одесі у театрі музичної комедії ім. М. Водяного 8 березня відбудеться циркове шоу, яке має назву «Alice».
                
                Тож, діти та дорослі, запрошуємо вас на захід, де ви зустрінетесь з героями відомої казки «Аліса у Країні Див» письменника Льюїса Керролла. Але попереджаємо, що цього разу буде дещо незвичайне, адже це не просто вистава, це циркове шоу з майстерними трюками, візуальними ефектами та оригінальними реквізитами.
                
                Як потрапити на виставу? Дуже просто – купити квитки онлайн та прийти до театру.  
                
                Зверніть увагу на події Одеського академічного театру музичної комедії ім. М. Водяного – тут на вас чекають вистави, концерти, циркове шоу для дітей та дорослих.
                
                Про шоу «Alice»
                «Alice» - це історія про Алісу Кінгслі, яка раптово потрапляє до чарівного світу Див. Ви побачите у виставі Божевільного Капелюшника, Кота, інших героїв казки та загалом сюжет вам буде знайомим. Але додайте до цього всього циркові номери, сучасні візуальні ефекти, дивовижні костюми, акторську майстерність вищого рівня й ви отримаєте зовсім інше враження.
                
                Отже, це шоу задовольнить самого вибагливо глядача та змусить вірити, що у світі немає нічого неможливого. Тож готуйтесь до події та приходьте всією родиною на циркове шоу «Alice».`
            },
            {
                title:"DOROFEEVA",
                date:"09 БЕРЕЗНЯ 2023",
                address:"Обласна філармонія",
                img:"./img/dor.jpg",
                price:"Ціна: 690 грн",
                info:`Концерт «Сенси» та благодійна мета
                Надя Дорофєєва співатиме для вас та заради тих людей, у яких було пошкоджене житло із-за війни. Тож частина  вторгованих коштів від концерту буде спрямована на відбудову будинків.
                
                Таким чином, це не просто подія, а благодійний вечір, в якому багато сенсів, як в тих піснях, що співає DOROFEEVA. І зараз співачка не обіцяє гучного шоу, але обіцяє вам особливу атмосферну подію, де кожен гість зможе відпочити душею та допомогти українським родинам! `
            },
            {
                title:"PIANOБОЙ",
                date:"08 БЕРЕЗНЯ 2023",
                address:"Обласна філармонія м. Одеса, вул. Буніна, 15",
                img:"./img/Pain.jpg",
                price:"Ціна: 350-1150 грн",
                info:`1. PIANOБOЙ – приклад сучасної української музики світового рівня, творчість артиста цікава людям різного віку.

                2. Прозвучать всі композиції, що вже стали хітами, а також абсолютно нові, але не менш яскраві та незабутні.
                
                3. Найкращий подарунок до свята весни та кохання – квиток на концерт PIANOБОЙ, головного сучасного романтика України!
                
                Pianoбoй – це індикатор музичного смаку, універсальний багатогранний артист, автор та композитор популярних хітів, сонграйтер, піаніст та тонкий лірик, чий талант по праву визнаний в Україні та за кордоном.
                
                Чоловіки, в наш непростий час, не бійтеся дарувати своїй єдиній, позитивні емоції, прекрасні враження і добрі, яскраві моменти – зараз це особливо важливо і потрібно. Подаруйте коханій жінці квиток на концерт Pianoбoй - головного сучасного романтика України, вона це гідно оцінить!`
            },
            {
                title:"СКРЯБІН",
                date:"03 квітня 2023",
                address:"Обласна філармонія",
                img:"./img/ku.jpg",
                price:"Ціна: 300-650 грн",
                info:`онцерт «Скрябін. Вечір пам’яті Кузьми» в Одесі
                3 квітня в Одесі відбудеться концерт, на який ви так довго очікували – «Скрябін. Вечір пам’яті Кузьмі». Подія відбудеться за участі музикантів, які довгі 20 років працювали на музичному фронті пліч-о-пліч з Андрієм Кузьменко. Це буде неймовірно емоційний концерт з якісним звуком та улюбленими піснями.
                
                Послухати хіти відомого співака можна буде цього вечора в Обласній філармонії, а ось купити квитки на подію на цій сторінці онлайн. Загалом, з сервісом «Kontramarka» кожен має можливість купувати квитки на будь-які події філармонії в Одесі.  `
            },
            {
                title:"ДИЗЕЛЬ ШОУ",
                date:"01 квітня 2023",
                address:"Одеський академічний театр музичної комедії ім. М. Водяного",
                img:"./img/dz.jpg",
                price:"Ціна: 600-1500 грн",
                info:`“Дизель Шоу” в Одесі!
                1 квітня 2023 року у Театрі музкомедії ім. М. Водяного відбудеться концерт “Дизель Шоу” в Одесі. На вас чекає  програма “Буде весна”. 
                
                Флагман українських розважальних шоу не випадково завітає до столиці гумору першого квітня. Кращого подарунку на День сміху годі й чекати. Хто-хто, а одесити знають толк у найвишуканішому гуморі, тож для них у  “Дизель Шоу” знайдеться особливий “десерт”.
                
                “Дизель шоу” з програмою “Буде весна”
                На вас чекають карколомні імпровізації, сценки в жанрі комедія інтриги, чудові музикальні номери. Свято гумору від “Дизель Шоу” - це справжній подарунок для одеситів.  `
            },
            {
                title:"ЮРІЙ ВЕЛИКИЙ",
                date:"04 квітня 2023",
                address:"Одеський академічний театр музичної комедії ім. М. Водяного",
                img:"./img/yr.jpg",
                price:"Ціна: 320-1240 грн",
                info:`Юрій Великий не потребує представлення. Гуморист, пародист, людина емоція, буря, просто божевілля. Відомий своєю участю в Кварталі-95 та гострими пародіями на самих довбанутих політиків сьогодення (це ми про Пуйла, Дона та Бульбокороля якщо шо).

                До нас він їде з величезним багажем влучного сарказму та гумору. «По-домашньому» - саме так називається його велике сольне шоу. Крилата фраза яка пішла від переляканих кримчан, що втікали з окупавонаго острову під час першої бавовни, для нас стала приводом для стьобу. Для Юри - окремим тематичним івентом. Не обійдеться без імпровізацій, пародій та затишного вечору, наповненого жартами та сміхом, якого так не вистачає сьогодні.`
            },
            {
                title:"БЕЗ ОБМЕЖЕНЬ",
                date:"08 квітня 2023",
                address:"Обласна філармонія",
                img:"./img/bez.jpg",
                price:"Ціна: 1350-1800 грн",
                info:`Підпишіться на нашу групу в соціальних мережах і ви будете в курсі всіх заходів`
            }
        ],
        Choose:[]
    }
});

/*
Чтобы связать хранилище и компонент, применяется провайдер - класс Provider из пакета "react-redux". 
У провайдера устанавливается объект хранилища через свойство store. Это хранилище и будет использоваться 
для поставки данных в AppView через функцию connect.
*/
ReactDOM.render(
    <Provider store={store}>
        <AppView/>
    </Provider>,
    document.getElementById("container")
);